/*******************************************************************
***  File Name          : c0.js
***  Version            : V1.0
***  Designer           : 曾根 悠太
***  Date               : 2022.07.02
***  Purpose            : カードファイルの書き方を示す
***
*******************************************************************/

/*
*** Revision :
*** c1.0 : 曾根 悠太, 2022.07.04
*/

const Card = require("./card.js");


module.exports = class c0 extends Card {

    //カードタイプ設定，
    static cardType = 1;

    //コンストラクタ，必要がなければいじらなくて大丈夫です．
    constructor(board,   //boardクラス
                player)  //playerクラス
    {
        super(board,player);
    }

/******************************************************************
*** Method Name         : effect()
*** Designer            : 曾根 悠太
*** Date                : 2022.07.02
*** Method              : カードの効果を適応する
*** Return              : なし
******************************************************************/

    effect(){
        console.log("test");
    }

/******************************************************************
*** Method Name         : afterEffect()
*** Designer            : 曾根 悠太
*** Date                : 2022.07.02
*** Method              : クライアントから送信後データを受け取った後の処理
*** Return              : なし
******************************************************************/

    afterEffect(){
        console.log("after");
    }

}