/*******************************************************************
***  File Name          : c38.js
***  Version            : V1.0
***  Designer           : 曾根 悠太 悠太
***  Date               : 2022.07.11
***  Purpose            : ルールカードの設定
***
*******************************************************************/

/*
*** Revision :
*** v1.0 : 曾根 悠太 悠太, 2022.07.11
*/

const Card = require("./card.js");

module.exports = class c38 extends Card {

    //カードタイプ設定，
    static cardType = 2;
    static term = [5,8];

    /****************************************************************************
    *** Method Name         : constructor()
    *** Designer            : 曾根 悠太 悠太
    *** Date                : 2022.07.11
    *** Method              : playerとboardオブジェクトの設定
    *** Return              : なし
    ****************************************************************************/

    //コンストラクタ，必要がなければいじらなくて大丈夫です．

    constructor(board,   //boardクラス
                player)  //playerクラス
    {
        super(board,player);
    }

    /******************************************************************
    *** Method Name         : effect()
    *** Designer            : 曾根 悠太 悠太
    *** Date                : 2022.07.11
    *** Method              : カードの効果を適応する
    *** Return              : なし
    ******************************************************************/

    effect(){
    }

    /******************************************************************
    *** Method Name         : afterEffect()
    *** Designer            : 武田 和大
    *** Date                : 2022.07.11
    *** Method              : クライアントから送信後データを受け取った後の処理
    *** Return              : なし
    ******************************************************************/

    //クライアントから送信後データを受け取った時
    afterEffect(data)   //sendData
    {//hoverCard


    }


}